In [22]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import warnings
warnings.filterwarnings("ignore")

In [23]:
df = pd.read_excel("../data/data_preprocessed.xlsx")

In [24]:
df.head()

,Driver_ID,Age,Gender,City,Education_Level,Income,Dateofjoining,LastWorkingDate,Joining Designation,Grade,Total Business Value,Quarterly Rating,Grade_change,Income_change,Quaterly_rating_change,target
0,1,28,0,C23,2,57387.0,24/12/18,03/11/19,1,1,571860.0,2,1,1,1,1
1,2,31,0,C7,2,67016.0,11/06/20,NaN,2,2,0.0,1,1,1,1,0
2,4,43,0,C13,2,65603.0,12/07/19,27/04/20,2,2,70000.0,1,1,1,1,1
3,5,29,0,C9,0,46368.0,01/09/19,03/07/19,1,1,40120.0,1,1,1,1,1
4,6,31,1,C11,1,78728.0,31/07/20,NaN,3,3,253000.0,2,1,1,2,0

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2381 entries, 0 to 2380
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Driver_ID               2381 non-null   int64
 1   Age                     2381 non-null   int64
 2   Gender                  2381 non-null   int64
 3   City                    2381 non-null   object
 4   Education_Level         2381 non-null   int64
 5   Income                  2381 non-null   float64
 6   Dateofjoining           2381 non-null   object
 7   LastWorkingDate         1616 non-null   object
 8   Joining Designation     2381 non-null   int64
 9   Grade                   2381 non-null   int64
 10  Total Business Value    2381 non-null   float64
 11  Quarterly Rating        2381 non-null   int64
 12  Grade_change            2381 non-null   int64
 13  Income_change           2381 non-null   int64
 14  Quaterly_rating_change  2381 non-null   int64
 15  target                  2381 non-null   int64
dtypes: float64(2), int64(11), object(3)
memory usage: 297.8+ KB

In [26]:
df.isna().sum()

Driver_ID                   0
Age                         0
Gender                      0
City                        0
Education_Level             0
Income                      0
Dateofjoining               0
LastWorkingDate           765
Joining Designation         0
Grade                       0
Total Business Value        0
Quarterly Rating            0
Grade_change                0
Income_change               0
Quaterly_rating_change      0
target                      0
dtype: int64

In [27]:
df["City"] = df["City"].apply(lambda x: int(x[1:]))

In [28]:
df["Dateofjoining"] = pd.to_datetime(df["Dateofjoining"])
df["LastWorkingDate"] = pd.to_datetime(df["LastWorkingDate"])

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2381 entries, 0 to 2380
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Driver_ID               2381 non-null   int64
 1   Age                     2381 non-null   int64
 2   Gender                  2381 non-null   int64
 3   City                    2381 non-null   int64
 4   Education_Level         2381 non-null   int64
 5   Income                  2381 non-null   float64
 6   Dateofjoining           2381 non-null   datetime64[ns]
 7   LastWorkingDate         1616 non-null   datetime64[ns]
 8   Joining Designation     2381 non-null   int64
 9   Grade                   2381 non-null   int64
 10  Total Business Value    2381 non-null   float64
 11  Quarterly Rating        2381 non-null   int64
 12  Grade_change            2381 non-null   int64
 13  Income_change           2381 non-null   int64
 14  Quaterly_rating_change  2381 non-null   int64
 15  target                  2381 non-null   int64
dtypes: datetime64[ns](2), float64(2), int64(12)
memory usage: 297.8 KB

In [30]:
df.isna().sum()

Driver_ID                   0
Age                         0
Gender                      0
City                        0
Education_Level             0
Income                      0
Dateofjoining               0
LastWorkingDate           765
Joining Designation         0
Grade                       0
Total Business Value        0
Quarterly Rating            0
Grade_change                0
Income_change               0
Quaterly_rating_change      0
target                      0
dtype: int64

In [31]:
df["join_year"] = df["Dateofjoining"].dt.year
df["join_month"] = df["Dateofjoining"].dt.month

In [32]:
df.drop(columns=["LastWorkingDate", "Dateofjoining", "Driver_ID"], inplace=True)

In [33]:
df.to_excel("../data/data_feature_engineered.xlsx", index=False)